{
  "additional_special_tokens": [
    "<s>NOTUSED",
    "</s>NOTUSED"
  ],
  "bos_token": "<s>",
  "cls_token": "<s>",
  "do_lower_case": false,
  "eos_token": "</s>",
  "ignore_mismatched_sizes": false,
  "mask_token": {
    "__type": "AddedToken",
    "content": "<mask>",
    "lstrip": true,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "max_len": 50,
  "model_max_length": 50,
  "pad_token": "<pad>",
  "sep_token": "</s>",
  "sp_model_kwargs": {},
  "special_tokens_map_file": null,
  "tokenizer_class": "CamembertTokenizer",
  "unk_token": "<unk>",
  "use_cuda": true,
  "use_fast": true
}
