{
  "_name_or_path": "drive/MyDrive/DEPOT/JOB_PARSER_PRETRAINED_",
  "architectures": [
    "CamembertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "B-NOM",
    "1": "I-NOM",
    "2": "B-POST",
    "3": "I-POST",
    "4": "O",
    "5": "B-ADRESSE",
    "6": "I-ADRESSE",
    "7": "B-ORG",
    "8": "I-HSKILL",
    "9": "B-HSKILL",
    "10": "B-TACHE",
    "11": "I-TACHE",
    "12": "I-ORG",
    "13": "B-DIPL\u00d4ME",
    "14": "I-DIPL\u00d4ME",
    "15": "B-ECOLE",
    "16": "I-ECOLE",
    "17": "B-LANGUE",
    "18": "I-LANGUE",
    "19": "B-SSKILL",
    "20": "I-SSKILL"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-ADRESSE": 5,
    "B-DIPL\u00d4ME": 13,
    "B-ECOLE": 15,
    "B-HSKILL": 9,
    "B-LANGUE": 17,
    "B-NOM": 0,
    "B-ORG": 7,
    "B-POST": 2,
    "B-SSKILL": 19,
    "B-TACHE": 10,
    "I-ADRESSE": 6,
    "I-DIPL\u00d4ME": 14,
    "I-ECOLE": 16,
    "I-HSKILL": 8,
    "I-LANGUE": 18,
    "I-NOM": 1,
    "I-ORG": 12,
    "I-POST": 3,
    "I-SSKILL": 20,
    "I-TACHE": 11,
    "O": 4
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "camembert",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.27.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32005
}
